URLShortener/app/models/shortened_url.rb

    def self.random_code
      short_url = SecureRandom::urlsafe_base64(16)
      while self.exists?(short_url)
---
SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "c5R03koiHYYnFsguBlvmpg"], ["LIMIT", 1]]

    def self.create_from_user(user, long_url)
      ShortenedUrl.create!( short_url: self.random_code,
                            long_url: long_url,
                            user_id: user.id
                          )
---
INSERT INTO "shortened_urls" ("short_url", "long_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["short_url", "c5R03koiHYYnFsguBlvmpg"], ["long_url", "http://google.com"], ["user_id", 1], ["created_at", "2018-11-08 01:01:40.152013"], ["updated_at", "2018-11-08 01:01:40.152013"]]
INSERT INTO "shortened_urls" ("short_url", "long_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["short_url", "agUwxJZJGUi4PLrJDTUWbg"], ["long_url", "google.com"], ["user_id", 3], ["created_at", "2018-11-08 01:16:57.583542"], ["updated_at", "2018-11-08 01:16:57.583542"]]